app/Controllers/Admin/Dashboard.php

SELECT max(id) as maxKode
FROM `data_permohonan`
 LIMIT 1
---
      $staff = $this->staffModel->getAllStaff();
      $warga = $this->wargaModel->getAllWarga();
      $desa = $this->desaModel->getDesa();
      $maxIdPermohonan = $permohonanModel->select('max(id) as maxKode')->first();