app/Models/DesaModel.php

public function getDesa()
   {
      return $this->findAll();
---
SELECT *
FROM `tb_desa`

public function getDesaByKode($kodeDesa)
   {
      return $this->where(['kodedesa' => $kodeDesa])
      ->findAll();
---
SELECT *
FROM `tb_desa`
WHERE `kodedesa` = '2003'