app/Models/JenissuratModel.php

   public function getAllJenisSurat()
   {
      return $this->findAll();
---
SELECT *
FROM `data_jenissurat`

   public function getAllJenisSuratNotTu()
   {
      $where ='Tata Usaha';
      return $this->where('kategori_surat !=', $where)->findAll();
---
SELECT *
FROM `data_jenissurat`
WHERE `kategori_surat` != 'Tata Usaha'