app/Models/KuaModel.php

public function getKua()
   {
      return $this->findAll();
---
SELECT *
FROM `data_kua`