app/Models/PermohonanModel.php

   public function getAllPermohonan()
   {
      return $this->findAll();
---
SELECT *
FROM `data_permohonan`

   public function getAllPermohonanByStatusOnproccess()
   {
      $status ='Onproccess';
      return $this->where('status =', $status)->findAll();
---
SELECT *
FROM `data_permohonan`
WHERE `status` = 'Onproccess'