app/Models/StaffModel.php

SELECT *
FROM `data_staff`
---
   public function getAllStaff()
   {
      return $this->findAll();