app/Models/StatistikModel.php

public function getAllStatistik()
   {
      return $this->findAll();
---
SELECT *
FROM `data_statistik`

   public function getAllStatistikByTanggalIp($tanggal)
   {
      return $this->where(['tanggal' => $tanggal])
      ->groupBy('ip')
      ->findAll();
---
SELECT *
FROM `data_statistik`
WHERE `tanggal` = '20241001'
GROUP BY `ip`

   public function getAllStatistikOnline()
   {
      $bataswaktu       = time() - 300;
      return $this->where(['online' => $bataswaktu])
      ->findAll();
---
SELECT *
FROM `data_statistik`
WHERE `online` = 1727773203

   public function getAllStatistikByIpTanggal($ip, $tanggal)
   {
      return $this->where(['ip' => $ip])
      ->where(['tanggal' => $tanggal])
      ->findAll();
---
SELECT *
FROM `data_statistik`
WHERE `ip` = '::1'
AND `tanggal` = '20241001'

   public function updateStatistik($ip, $tanggal,$waktu)
   {
      return $this->save([
         'ip' => $ip,
         'tanggal' => $tanggal,
         'hits' => 1,
         'online' => $waktu
      ]);
---
INSERT INTO `data_statistik` (`ip`, `tanggal`, `hits`, `online`) VALUES ('::1', '20241001', 1, 1727773503)