app/Models/SuratModel.php

   public function getAllSuratAndStaffAndJenis()
   {
      return $this->join(
         'data_staff',
         'data_staff.id = tb_detailsurat.ttd',
         'LEFT'
         )
      ->join(
         'data_jenissurat',
         'data_jenissurat.kode_jenis = tb_detailsurat.kode_jenis',
         'LEFT'
         )
      ->orderBy('tb_detailsurat.id_surat', 'DESC')
      ->findAll();
---
SELECT *
FROM `tb_detailsurat`
LEFT JOIN `data_staff` ON `data_staff`.`id` = `tb_detailsurat`.`ttd`
LEFT JOIN `data_jenissurat` ON `data_jenissurat`.`kode_jenis` = `tb_detailsurat`.`kode_jenis`
ORDER BY `tb_detailsurat`.`id_surat` DESC