app/Models/WargaModel.php

SELECT *
FROM `data_warga`
---
public function getAllWarga()
   {
      return $this->findAll();